In [63]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [64]:
%sql mysql+pymysql://student:mds-is-fun@witchcraft.csbmzoea3lu9.us-east-1.rds.amazonaws.com/witchcraft

### 1. Getting to know the data

##### a) Show a list of the tables included in the database.

In [65]:
%sql SHOW TABLES

 * mysql+pymysql://student:***@witchcraft.csbmzoea3lu9.us-east-1.rds.amazonaws.com/witchcraft
37 rows affected.

[('accused',),
 ('accused_family',),
 ('appeal',),
 ('calendarcustom',),
 ('case_person',),
 ('commission',),
 ('complaint',),
 ('confession',),
 ('counterstrategy',),
 ('demonicpact',),
 ('denunciation',),
 ('devilappearance',),
 ('elf_fairyelements',),
 ('imprisonment',),
 ('linkedtrial',),
 ('malice',),
 ('mentionedaswitch',),
 ('movestohla',),
 ('musicalinstrument',),
 ('ordeal',),
 ('othercharges',),
 ('othernamedwitch',),
 ('person',),
 ('prevcommission',),
 ('propertydamage',),
 ('ref_parish',),
 ('reference',),
 ('religiousmotif',),
 ('ritualobject',),
 ('shapechanging',),
 ('source',),
 ('torture',),
 ('trial',),
 ('trial_person',),
 ('weathermodification',),
 ('whitemagic',),
 ('witchesmeetingplace',)]

##### b) Display the column names for the table accused.

In [4]:
%%sql
DESCRIBE accused

 * mysql+pymysql://student:***@witchcraft.csbmzoea3lu9.us-east-1.rds.amazonaws.com/witchcraft
31 rows affected.

[('accusedref', 'varchar(10)', 'YES', '', None, ''),
 ('accusedsystemid', 'varchar(3)', 'YES', '', None, ''),
 ('accusedid', 'double', 'YES', '', None, ''),
 ('firstname', 'varchar(36)', 'YES', '', None, ''),
 ('lastname', 'varchar(25)', 'YES', '', None, ''),
 ('m_firstname', 'varchar(29)', 'YES', '', None, ''),
 ('m_surname', 'varchar(21)', 'YES', '', None, ''),
 ('alias', 'varchar(26)', 'YES', '', None, ''),
 ('patronymic', 'varchar(14)', 'YES', '', None, ''),
 ('destitle', 'varchar(28)', 'YES', '', None, ''),
 ('sex', 'varchar(6)', 'YES', '', None, ''),
 ('age', 'double', 'YES', '', None, ''),
 ('age_estcareer', 'tinyint', 'YES', '', None, ''),
 ('age_estchild', 'tinyint', 'YES', '', None, ''),
 ('res_settlement', 'varchar(22)', 'YES', '', None, ''),
 ('res_parish', 'varchar(10)', 'YES', '', None, ''),
 ('res_presbytery', 'varchar(17)', 'YES', '', None, ''),
 ('res_county', 'varchar(13)', 'YES', '', None, ''),
 ('res_burgh', 'varchar(13)', 'YES', '', None, ''),
 ('res_ngr_letters', 'varchar(2)', 'YES', '', None, ''),
 ('res_ngr_easting', 'double', 'YES', '', None, ''),
 ('res_ngr_northing', 'double', 'YES', '', None, ''),
 ('ethnic_origin', 'varchar(7)', 'YES', '', None, ''),
 ('maritalstatus', 'varchar(15)', 'YES', '', None, ''),
 ('socioecstatus', 'varchar(15)', 'YES', '', None, ''),
 ('occupation', 'varchar(14)', 'YES', '', None, ''),
 ('notes', 'text', 'YES', '', None, ''),
 ('createdby', 'varchar(3)', 'YES', '', None, ''),
 ('createdate', 'datetime', 'YES', '', None, ''),
 ('lastupdatedby', 'varchar(3)', 'YES', '', None, ''),
 ('lastupdatedon', 'datetime', 'YES', '', None, '')]

##### c) How many people are included in the accused table?

In [6]:
%%sql
SELECT COUNT(*)
FROM accused

 * mysql+pymysql://student:***@witchcraft.csbmzoea3lu9.us-east-1.rds.amazonaws.com/witchcraft
1 rows affected.

[(3219,)]

##### d) Display the columns firstname, sex, and age for 5 cases in the accused table.

In [10]:
%%sql
SELECT firstname, sex, age
FROM accused
LIMIT 5

 * mysql+pymysql://student:***@witchcraft.csbmzoea3lu9.us-east-1.rds.amazonaws.com/witchcraft
5 rows affected.

[('Mareon', 'Female', None),
 ('Thom', 'Male', None),
 ('Christian', 'Female', None),
 ('Janet', 'Female', None),
 ('Agnes', 'Female', None)]

##### e) Looks like the age is missing for some observations. Count the number of nonmissing values for age in the data.

In [11]:
%%sql
SELECT COUNT(age)
FROM accused

 * mysql+pymysql://student:***@witchcraft.csbmzoea3lu9.us-east-1.rds.amazonaws.com/witchcraft
1 rows affected.

[(166,)]

##### f) Show a list of unique occupations.

In [12]:
%%sql
SELECT DISTINCT occupation
FROM accused

 * mysql+pymysql://student:***@witchcraft.csbmzoea3lu9.us-east-1.rds.amazonaws.com/witchcraft
32 rows affected.

[(None,),
 ('Servant',),
 ('Vagabond',),
 ('Weaver',),
 ('Midwife',),
 ('Tailor',),
 ('Messenger',),
 ('Brewster',),
 ('Smith',),
 ('Minister',),
 ('Farmer',),
 ('Mealmaker',),
 ('Tasker',),
 ('Maltman',),
 ('Miller',),
 ('Healer',),
 ('Loadman',),
 ('Blacksmith',),
 ('Shop-keeper',),
 ('Stabler',),
 ('Nurse',),
 ('Collier',),
 ('School teacher',),
 ('Slaterer',),
 ('Workman',),
 ('School Master',),
 ('Merchant',),
 ('Fisherman',),
 ('Henwife',),
 ('Cook',),
 ('Sailor',),
 ('Creelman',)]

### 2. Seeing the Devil

##### a) List the unique devil_types in the data.

In [14]:
%%sql
SELECT DISTINCT devil_type
FROM devilappearance

 * mysql+pymysql://student:***@witchcraft.csbmzoea3lu9.us-east-1.rds.amazonaws.com/witchcraft
16 rows affected.

[('Male',),
 ('Female Fairy',),
 ('Male Fairy',),
 ('Animal Devil',),
 ('Spirit',),
 ('Ghost',),
 ('Other Demon',),
 ('Female',),
 (None,),
 ('Fairy',),
 ('Unspecified Devil',),
 ('Insect Devil',),
 ('Baby',),
 ('Human Devil',),
 ('Child Devil',),
 ('Inanimate Object Devil',)]

##### b) There is also a little description of the type of the devil sighting in the devil_text column. How many of the sightings mention the word "black" in the description?

In [15]:
%%sql
SELECT COUNT(*)
FROM devilappearance
WHERE devil_text LIKE "%black%"

 * mysql+pymysql://student:***@witchcraft.csbmzoea3lu9.us-east-1.rds.amazonaws.com/witchcraft
1 rows affected.

[(121,)]

##### c) What proportion of the devils (in devil_type) are male?

In [93]:
%%sql
SELECT ROUND(COUNT(devil_type)/(SELECT COUNT(devil_type) FROM devilappearance)*100,2) AS percent_male
FROM devilappearance
WHERE devil_type = 'Male'

 * mysql+pymysql://student:***@witchcraft.csbmzoea3lu9.us-east-1.rds.amazonaws.com/witchcraft
1 rows affected.

[(Decimal('63.45'),)]

### 3. The trial

##### a) What are the average and maximum numbers of male and female accusers?

In [33]:
%%sql
SELECT AVG(female_accusers), AVG(male_accusers), MAX(female_accusers), MAX(male_accusers)
FROM trial

 * mysql+pymysql://student:***@witchcraft.csbmzoea3lu9.us-east-1.rds.amazonaws.com/witchcraft
1 rows affected.

[(0.2559226932668329, 0.4181988158304768, 27.0, 48.0)]

##### b) Count the number of sentences by sentence type. List them in a table (in descending order), excluding missing values. Rename the column headings to something sensible.

In [79]:
%%sql
SELECT sentence AS SentenceType, COUNT(sentence) AS Number_of_Sentence
FROM trial
GROUP BY SentenceType
ORDER BY Number_of_Sentence DESC

 * mysql+pymysql://student:***@witchcraft.csbmzoea3lu9.us-east-1.rds.amazonaws.com/witchcraft
11 rows affected.

[('Execution', 205),
 ('Released', 52),
 ('Banishment', 27),
 ('Declared Fugitive', 11),
 ('Excommunicated', 6),
 ('Put to the horn', 2),
 ('Hang', 1),
 ('Branded', 1),
 ('Prison', 1),
 ('Public Humiliation', 1),
 (None, 0)]

##### c) Do the number of accusers matter for the verdict? Compare the average number of accusers by the type of verdict. Again make sure the table is sorted and the headings make sense.

In [50]:
%%sql
SELECT verdict, ROUND(AVG(male_accusers+female_accusers),2) AS Number_of_Accusers
FROM trial
GROUP BY verdict
ORDER BY Number_of_Accusers DESC

 * mysql+pymysql://student:***@witchcraft.csbmzoea3lu9.us-east-1.rds.amazonaws.com/witchcraft
5 rows affected.

[('Guilty', 5.8),
 ('Not Guilty', 4.56),
 ('Not Proven', 1.0),
 ('Half Guilty', 0.29),
 (None, 0.2)]

##### 4. Tortured Truth

##### a) Left join the trial and confession tables. For what share of trials does the database record confessions? Create a results table with the number of all trials, the number of confessions, and the share of trials with confessions recorded.

In [95]:
%%sql
SELECT 
    COUNT(DISTINCT trial.trialref) AS Number_of_Trials, 
    COUNT(DISTINCT confession.trialref) AS Number_of_Confessions, 
    (COUNT(DISTINCT confession.trialref)/COUNT(DISTINCT trial.trialref)) AS Share_of_Confessions
FROM trial
LEFT JOIN confession
ON trial.trialref = confession.trialref

 * mysql+pymysql://student:***@witchcraft.csbmzoea3lu9.us-east-1.rds.amazonaws.com/witchcraft
1 rows affected.

[(3211, 756, Decimal('0.2354'))]

##### b) Only a small number of trials have records of torture. Is there a higher share of confessions among trials with records of torture than trials without such record? Hint: You will need to merge on the confession table.

In [103]:
%%sql
WITH trial_tortured AS(
SELECT COUNT(DISTINCT trialref) as num_of_toutured_trial 
FROM torture)

SELECT (COUNT(DISTINCT torture.trialref) / (SELECT num_of_toutured_trial FROM trial_tortured)) as share_of_confession_tortured 
FROM torture 
LEFT JOIN confession 
ON torture.trialref = confession.trialref
WHERE confessionref IS NOT NULL

 * mysql+pymysql://student:***@witchcraft.csbmzoea3lu9.us-east-1.rds.amazonaws.com/witchcraft
1 rows affected.

[(Decimal('0.4231'),)]

In [104]:
%%sql
WITH trial_not_torture AS(
SELECT *
FROM trial
WHERE trialref NOT IN (SELECT DISTINCT trialref FROM torture))

SELECT COUNT(DISTINCT trial_not_torture.trialref) / (SELECT COUNT(trial_not_torture.trialref) FROM trial_not_torture) AS share_of_confession_notortured
FROM trial_not_torture 
LEFT JOIN confession 
ON trial_not_torture.trialref = confession.trialref
WHERE confessionref IS NOT NULL

 * mysql+pymysql://student:***@witchcraft.csbmzoea3lu9.us-east-1.rds.amazonaws.com/witchcraft
1 rows affected.

[(Decimal('0.2324'),)]